In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Words of Caution ##
- Remember to run the cell above. It's for setting up the environment so you can have access to what's needed for this lecture. For now, don't worry about what it means: we'll learn more about what's inside of it in the next few lectures.
- Data science is not just about code, so please don't go over this notebook by itself. Have the relevant textbook sections or lecture video at hand so that you can go over the discussion along with the code. Thank you!

## Python ##

In [2]:
# add 2 and 9
2 + 9

11

In [3]:
# multiply 2 and 9
2*(9)

18

In [4]:
# divide 2 by 9
2 / 9

0.2222222222222222

In [5]:
# add 2 and 3 then multiply by 9
2+3*9

29

In [6]:
# add 2 and 3 then multiply the sum by 9
(2+3)*9

45

In [7]:
# raise 2 to the power of 4
# 2**4
pow(2,4)

16

In [8]:
# run this cell
"hello"

'hello'

## Names ##

In [9]:
# assign 4 to a
a = 4

In [10]:
# print a
a

4

In [11]:
# assign 9 to b
b = 9

In [12]:
# print b
b

9

In [13]:
# multiply a by 3
a*3

12

In [14]:
# assign the sum of a and b to total
total = a + b

In [15]:
# print total
total

13

In [16]:
# assign 10 to a
a = 10

In [17]:
# print total
total

13

In [18]:
# assign the sum of a and b to total
total = a + b

In [19]:
# print total
total

19

In [20]:
# run this cell
'total'

'total'

### Why Names?

In [21]:
# assign the number of hours in a work week to hours_per_week
# assign the number of weeks in a year to week_per_year
hours_per_week = 8 * 5
weeks_per_year = 52

In [22]:
# assign the product of the number of hours in a work week and the number
# of weeks per year to hours_per_year (DO NOT USE NUMBERS)
hours_per_year = hours_per_week * weeks_per_year

In [23]:
# Print hours_per_year
hours_per_year

2080

In [24]:
# assign the minimum wage in NC to nc_hourly_minimum_wage
nc_hourly_minimum_wage = 7.25

In [25]:
# assign the number of hours per week times minimum wage to weekly_wages
# print weekly_wages
weekly_wages = hours_per_week * nc_hourly_minimum_wage
weekly_wages

290.0

In [26]:
# assign the number of hours worked in a year times the minimum wage to 
# yearly_wages
# print yearly_wages
yearly_wages = hours_per_year * nc_hourly_minimum_wage
yearly_wages

15080.0

In [27]:
# determine the weekly wage without using assignment statements
7.25*40

290.0

In [28]:
# determine the yearly wages without using assignment statements
7.25*40*52

15080.0

## Functions and Call Expressions

In [29]:
# find the absolute value of -5
abs(-5)

5

In [30]:
# find the absolute value of 1 minus 3
abs(1-3)

2

In [31]:
# assign 52 to day_temp
# assign 47 to night_temp
# find the absolute value of the difference between the day_temp and night_temp
day_temp = 52
night_temp = 47
abs(day_temp - night_temp)

5

In [32]:
# use the min function to find the minimum among the following numbers
# 14, 15, -5280, -3, 123456
min(14, 15, -5280, -3, 123456)

-5280

In [37]:
# use the round function to round 123.456
round(123.456)

123

In [40]:
# use the round function to round 123.456 to 1 decimal place
round(123.456, 1)

123.5

In [42]:
# use the round function to round 123.45678901 to 4 decimal places
# use ndigits=
round(123.45678901, ndigits=4)

123.4568

## Tables ##

In [43]:
# creating a table called cones using the read_table function
cones = Table.read_table('data/cones.csv')
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [44]:
cones.show(3)

In [45]:
cones.show()

In [47]:
# display only the Flavor column of the table cones
cones.select('Flavor')

Flavor
strawberry
chocolate
chocolate
strawberry
chocolate
bubblegum

In [49]:
# display the Flavor and Price columns of the table cones
#cones.select('Flavor', 'Price')
cones.select(0, 2)

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [50]:
# will this code work?
cones.select(Flavor, 'Price')

NameError: name 'Flavor' is not defined

In [52]:
# drop the column Price
cones.drop('Price')

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [53]:
# run this cell to see if the original cones table changes
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [54]:
# drop the column Price and assign this new table to cones_without_price
# print cones_without_price
cones_without_price = cones.drop('Price')
cones_without_price

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [55]:
# display only rows where the flavor is chocolate
cones.where('Flavor', 'chocolate')

Flavor    | Color       | Price
chocolate | light brown | 4.75
chocolate | dark brown  | 5.25
chocolate | dark brown  | 5.25

In [56]:
# sort the table by price
cones.sort('Price')

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25

In [57]:
# sort the table to show the highest price at the top
cones.sort('Price', descending = True)

Flavor     | Color       | Price
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
strawberry | pink        | 3.55

In [58]:
# assign the table that only displays the price to "a"
# print "a" (NOTE: do not use the quotes, only the letter)
a = cones.select('Price')
a

Price
3.55
4.75
5.25
5.25
5.25
4.75

In [59]:
cones.sort('Flavor', descending=True)

Flavor     | Color       | Price
strawberry | pink        | 3.55
strawberry | pink        | 5.25
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

### A more interesting table

In [60]:
# reading in a file and assigning it to skyscrapers
skyscrapers = Table.read_table('data/skyscrapers.csv')
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [61]:
# display skyscrapers that are located in Charlotte
skyscrapers.where('city', 'Charlotte')

name                             | material       | city      | height | completed
Bank of America Corporate Center | concrete       | Charlotte | 265.48 | 1992
Duke Energy Center               | concrete/steel | Charlotte | 239.7  | 2010
Hearst Tower                     | steel/concrete | Charlotte | 200.81 | 2002

In [62]:
# display information about only the Empire State Building
skyscrapers.where('name', 'Empire State Building')

name                  | material | city          | height | completed
Empire State Building | steel    | New York City | 381    | 1931

In [64]:
# display skyscrapers in New York City and sort by the oldest COMPLETED first
skyscrapers.where('city', 'New York City').sort('completed')

name                    | material | city          | height | completed
Metropolitan Life Tower | steel    | New York City | 213.36 | 1909
Woolworth Building      | steel    | New York City | 241.4  | 1913
Chanin Building         | steel    | New York City | 197.8  | 1929
Mercantile Building     | steel    | New York City | 192.6  | 1929
Chrysler Building       | steel    | New York City | 318.9  | 1930
The Trump Building      | steel    | New York City | 282.55 | 1930
One Grand Central Place | steel    | New York City | 205.13 | 1930
Empire State Building   | steel    | New York City | 381    | 1931
Twenty Exchange         | steel    | New York City | 225.86 | 1931
500 Fifth Avenue        | steel    | New York City | 212.45 | 1931
... (63 rows omitted)

In [65]:
# display skyscrapers in New York City and sort by the newest COMPLETED first
skyscrapers.where('city', 'New York City').sort('completed', descending = True)

name                                             | material       | city          | height | completed
432 Park Avenue                                  | concrete       | New York City | 425.5  | 2015
Sky                                              | concrete       | New York City | 206    | 2015
One World Trade Center                           | composite      | New York City | 541.3  | 2014
One57                                            | steel/concrete | New York City | 306.07 | 2014
4 World Trade Center                             | composite      | New York City | 297.73 | 2014
Courtyard & Residence Inn Manhattan/Central Park | concrete       | New York City | 229.62 | 2013
Eight Spruce Street                              | concrete       | New York City | 265.18 | 2011
1 MiMA Tower                                     | concrete       | New York City | 194.55 | 2011
Goldman Sachs Headquarters                       | steel          | New York City | 228.3  | 2010
Langham Place                                    | concrete       | New York City | 192.58 | 2010
... (63 rows omitted)

In [66]:
# display the skyscrapers in order, starting with the tallest
skyscrapers.sort('height', descending = True)

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)